[
  {
    "name": "Billal Patel",
    "title": "Senior SDET",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/d8ed8525-0fe4-47be-89bf-6ca73981a4e4.jpg",
    "date": "28 May 2025",
    "text": "I really enjoyed the session with Eduardo. He asks intriguing questions that get me thinking all whilst being gentle and approachable. Already looking forward to our next session.",
    "rating": 5
  },
  {
    "name": "Billal Patel",
    "title": "Senior SDET",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/d8ed8525-0fe4-47be-89bf-6ca73981a4e4.jpg",
    "date": "29 April 2025",
    "text": "Amazing session. Eduardo surpassed my expectations as he was a great listener and produced some really good suggestions for us to tackle over the coming weeks. I look forward to our next session!",
    "rating": 5
  },
  {
    "name": "Gianluca Galota",
    "title": "Frontend Engineer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/ecdf61ee-440d-4b82-bbe8-514b061722dd.jpg",
    "date": "28 January 2025",
    "text": "I had a an amazing mentoring session with Eduardo. He is a great and practical engineer and professional. In less than one hour we managed to get a clear understanding of my actual professional situation and started building a framework to follow for a growth plan. I totally recommend him for anybody looking to up skills his programming skills or advance in his career!",
    "rating": 5
  },
  {
    "name": "Daniela Burgos",
    "title": "Software Engineer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/8350b3cd-326e-4370-9091-6a313499f061.jpg",
    "date": "9 January 2025",
    "text": "",
    "rating": 5
  },
  {
    "name": "Daniela Burgos",
    "title": "Software Engineer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/8350b3cd-326e-4370-9091-6a313499f061.jpg",
    "date": "11 November 2024",
    "text": "I really enjoyed the session! Eduardo is incredibly knowledgeable about Next.js and patient in his explanations. Thank you so much for all your help! The only small challenge was with the Zoom call occasionally interrupting the flow, but I understand the importance of keeping the sessions short to avoid overwhelming anyone.",
    "rating": 5
  },
  {
    "name": "Priyanko Das",
    "title": "Senior Frontend Developer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/15ad9156-df5a-44e7-bc31-b9fe8f6a9a30.jpg",
    "date": "2 September 2024",
    "text": "",
    "rating": 5
  },
  {
    "name": "Osman Herrera",
    "title": "Graphic Designer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/11e9e094-2a05-4838-9a99-40a73bb6a5ba.jpg",
    "date": "20 May 2024",
    "text": "Sometimes we struggle with things besides professional skills and technical matters. Eduardo is always there and is an excellent person who hears you and helps you reach your goals. He is an admirable human being and an exceptional professional. He truly has a vocation for what he does.",
    "rating": 5
  },
  {
    "name": "Zacharias Voulgaris",
    "title": "Strategic advisor, data scientist, and mentor",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/ab275a04-a581-484c-b15c-ec0fe61c2989.jpg",
    "date": "9 May 2024",
    "text": "Excellent mentor. He answered all my questions and even went the extra mile by trying to understand the problem at hand and help me explore other alternatives I hadn't considered (not in-depth, at least). After the session, he also provided me with a message summarizing our meeting and some key takeaways from it, strategies I can investigate further. Highly recommended!",
    "rating": 5
  },
  {
    "name": "Osman Herrera",
    "title": "Graphic Designer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/11e9e094-2a05-4838-9a99-40a73bb6a5ba.jpg",
    "date": "17 April 2024",
    "text": "Incredible session, it's admirable how he takes his time to help us and get involved in our success as if it were his own. Very grateful and we look forward to future sessions because it's a process where he guides you every step of the way. Thank you Eduardo.",
    "rating": 5
  },
  {
    "name": "Osman Herrera",
    "title": "Graphic Designer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/11e9e094-2a05-4838-9a99-40a73bb6a5ba.jpg",
    "date": "6 March 2024",
    "text": "I am very happy with the session, it was really needed time but I am amazed by Eduardo's ability to analyze the person and identify strengths while also analyzing shortcomings and areas for improvement. He truly is a mentor in every sense of the word. We conducted the session in Spanish, which he speaks perfectly, and he also conducts sessions in English. We are studying specific areas for improvement and as we progress through these areas, we continue to improve the rest. It is uplifting to have a session with him.\n\nEstoy muy contento con la sesion, realmente hizo falta tiempo pero me asombra la capacidad que Eduardo tiene de analizar a la persona e identificar las fortalezas al mismo tiempo analiza las carencias y puntos a mejorar. Realmente es un mentor con todo el sentido de la palabra. Hicimos la sesion en español el cual habla perfectamente tambien hace sesiones en ingles. Estamos estudiando areas puntuales para mejorar y al pasar de estas areas seguir mejorando las restante. Es edificante tener una sesion con el.",
    "rating": 5
  },
  {
    "name": "Marcus Shakes",
    "title": "Test Engineer",
    "image": "https://www.mentoring-club.com/assets/img/defaultMentor.jpg",
    "date": "7 February 2024",
    "text": "Excellent mentoring session! Eduardo was patient and understanding of my skills/ level of understanding of certain technologies, and gave great guidance.",
    "rating": 5
  },
  {
    "name": "Deepak Kumar",
    "title": "Software Developer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/2c6ee49a-dab8-43c3-b810-1a4d5a117838.jpg",
    "date": "30 January 2024",
    "text": "Had an incredibly insightful mentorship session with Eduardo, a top-notch developer with a heart of gold. He adeptly guided me on refining the mentoring process for junior frontend devs and excelling in advanced frontend skills. The session was both informative and engaging, showcasing Eduardo's expertise. Grateful for the valuable insights and his generous dedication of time from his busy schedule. A truly enriching experience!",
    "rating": 5
  },
  {
    "name": "Max Frederiksen",
    "title": "Web Developer",
    "image": "https://www.mentoring-club.com/assets/img/defaultMentor.jpg",
    "date": "11 December 2023",
    "text": "Eduardo had prepared a mock interview, which helped me practice, and he provided a lot of feedback at the end of the session. He is very good at moderating by not wasting any time and also having a great eye for details; he can really pinpoint where I could improve and what I did well. Excellent Mentor!",
    "rating": 5
  },
  {
    "name": "Deepak Kumar",
    "title": "Software Developer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/2c6ee49a-dab8-43c3-b810-1a4d5a117838.jpg",
    "date": "30 November 2023",
    "text": "Every minute was worthwhile. His expertise, clarity, and personalized guidance shone through, propelling my proficiency in advanced frontend skills. Grateful for such a highly impactful session. Highly recommend for anyone seeking advanced frontend mastery.",
    "rating": 5
  },
  {
    "name": "Max Frederiksen",
    "title": "Web Developer",
    "image": "https://www.mentoring-club.com/assets/img/defaultMentor.jpg",
    "date": "20 November 2023",
    "text": "Excellent feedback, quick and decisive in pinpointing my problems and providing resources and helpful mindsets to tackle them.",
    "rating": 5
  },
  {
    "name": "Meshach Arinze",
    "title": "Frontend engineer",
    "image": "https://mentoring-club-mentors.s3.eu-central-1.amazonaws.com/profilepics/medium/cc8b6d53-748f-4b65-b0ae-f3972c2baca8.jpg",
    "date": "25 October 2023",
    "text": "I really had an awesome session with Eduardo AC. I learnt a lot as a mentee from him. Especially how to improve my technical skill to soft skill. It was indeed an awesome time",
    "rating": 5
  }
] 